package _2.array._5;

import java.util.Scanner;

/**
 * 5th, 소수(PrimeNumber), 에라토스테네스 체(Sieve)
 * 1. 설명
 *  1과 자기 자신을 양의 약수로 가지는 수를 가리켜 '소수'라고 부른다.
 *  양의 약수를 2개 가진다고 보면 된다. 예를 들면 2, 3, 5, 7 ,11 ... 등이 존재한다.
 *  이런 소수를 대량으로 구할 수 있는 게 바로 '에라토스테네스의 체'다.
 *
 *  소수(1과 자기자신(양의 약수를 2개 가지는 수))를 대량으로 빠르고 정확하게 구하는 방법이다.
 *  자연수 N이 입력되면 1부터 N까지의 소수 개수를 출력하는 프로그램
 *  만약 20이 입력되면 1부터 20까지의 소수는 2, 3, 5, 7, 11, 13, 17, 19 총 8개다.
 *
 * 2. 입력설명
 *  첫 줄에 자연수의 개수 N이 주어짐.
 *
 * 3. 출력설명
 *  첫 줄에 소수의 개수를 출력함.
 *
 * 4. 입력예제 20, 출력예제 8
 *
 * 5. 생각정리
 *  5-1) 1과 자기 자신을
 */
public class PrimeNumberSieve {
	public static void main(String[] args) {
		Scanner kb = new Scanner(System.in);
	}
}
