package _2.array._3;

/**
 * 3th, 가위바위보
 *
 * 1. 설명
 *  A, B 두 사람이 가위바위보 게임을 한다. 총 N번의 게임을 해
 *  A가 이기면 A를 출력하고, B가 이기면 B를 출력합니다.
 *  비길 경우에는 D를 출력한다. 두 사람의 각회의 가위바위보 정보가 주어지면
 *  각회를 누가 이겼는지 출력하는 프로그램
 *
 * 2. 입력 설명
 *  첫 번째 줄에 게임 횟수인 자연수 N이 주어진다.
 *  두 번째 줄에는 A가 낸 가위바위보 정보가 N개 주어진다.
 *  세 번째 줄에는 B가 낸 가위바위보 정보가 N개 주어진다.
 *
 * 3. 출력설명
 *  각 줄에 각호의 승자를 출력한다.
 *  비겼을 때 D를 출력한다.
 *
 * 4. 입력예제 5,  A : 2 3 3 1 3, B : 1 1 2 2 3 출력예제 A B A B D
 *
 * 5. 생각정리
 *  1-1)
 *
 *  1-2)
 *
 *  1-3)
 *
 */
public class Main {
}
